votrunghieu29598/STM32F446ZE_STD/BitBand/USER/bitband_f4.h
#include "stm32f4xx.h"                  // Device header

/*******************************************************************************/
/*-------------------------- GPIOA ---------------------------------*/
// GPIOA_OUT
#define A0_OUT  (*(volatile uint32_t*)0x42400280)
#define A1_OUT  (*(volatile uint32_t*)0x42400284)
#define A2_OUT  (*(volatile uint32_t*)0x42400288)
#define A3_OUT  (*(volatile uint32_t*)0x4240028C)
#define A4_OUT  (*(volatile uint32_t*)0x42400290)
#define A5_OUT  (*(volatile uint32_t*)0x42400294)
#define A6_OUT  (*(volatile uint32_t*)0x42400298)
#define A7_OUT  (*(volatile uint32_t*)0x4240029C)
#define A8_OUT  (*(volatile uint32_t*)0x424002A0)
#define A9_OUT  (*(volatile uint32_t*)0x424002A4)
#define A10_OUT (*(volatile uint32_t*)0x424002A8)
#define A11_OUT (*(volatile uint32_t*)0x424002AC)
#define A12_OUT (*(volatile uint32_t*)0x424002B0)
#define A13_OUT (*(volatile uint32_t*)0x424002B4)
#define A14_OUT (*(volatile uint32_t*)0x424002B8)
#define A15_OUT (*(volatile uint32_t*)0x424002BC)	
// GPIOB_OUT
#define B0_OUT  (*(volatile uint32_t*)0x42408280)
#define B1_OUT  (*(volatile uint32_t*)0x42408284)
#define B2_OUT  (*(volatile uint32_t*)0x42408288)
#define B3_OUT  (*(volatile uint32_t*)0x4240828C)
#define B4_OUT  (*(volatile uint32_t*)0x42408290)
#define B5_OUT  (*(volatile uint32_t*)0x42408294)
#define B6_OUT  (*(volatile uint32_t*)0x42408298)
#define B7_OUT  (*(volatile uint32_t*)0x4240829C)
#define B8_OUT  (*(volatile uint32_t*)0x424082A0)
#define B9_OUT  (*(volatile uint32_t*)0x424082A4)
#define B10_OUT (*(volatile uint32_t*)0x424082A8)
#define B11_OUT (*(volatile uint32_t*)0x424082AC)
#define B12_OUT (*(volatile uint32_t*)0x424082B0)
#define B13_OUT (*(volatile uint32_t*)0x424082B4)
#define B14_OUT (*(volatile uint32_t*)0x424082B8)
#define B15_OUT (*(volatile uint32_t*)0x424082BC)
// GPIOB_IN
#define B0_IN  (*(volatile uint32_t*)0x42408200)
#define B1_IN  (*(volatile uint32_t*)0x42408204)
#define B2_IN  (*(volatile uint32_t*)0x42408208)
#define B3_IN  (*(volatile uint32_t*)0x4240820C)
#define B4_IN  (*(volatile uint32_t*)0x42408210)
#define B5_IN  (*(volatile uint32_t*)0x42408214)
#define B6_IN  (*(volatile uint32_t*)0x42408218)
#define B7_IN  (*(volatile uint32_t*)0x4240821C)
#define B8_IN  (*(volatile uint32_t*)0x42408220)
#define B9_IN  (*(volatile uint32_t*)0x42408224)
#define B10_IN (*(volatile uint32_t*)0x42408228)
#define B11_IN (*(volatile uint32_t*)0x4240822C)
#define B12_IN (*(volatile uint32_t*)0x42408230)
#define B13_IN (*(volatile uint32_t*)0x42408234)
#define B14_IN (*(volatile uint32_t*)0x42408238)
#define B15_IN (*(volatile uint32_t*)0x4240823C)		
// GPIOC_OUT
#define C0_OUT  (*(volatile uint32_t*)0x42410280)
#define C1_OUT  (*(volatile uint32_t*)0x42410284)
#define C2_OUT  (*(volatile uint32_t*)0x42410288)
#define C3_OUT  (*(volatile uint32_t*)0x4241028C)
#define C4_OUT  (*(volatile uint32_t*)0x42410290)
#define C5_OUT  (*(volatile uint32_t*)0x42410294)
#define C6_OUT  (*(volatile uint32_t*)0x42410298)
#define C7_OUT  (*(volatile uint32_t*)0x4241029C)
#define C8_OUT  (*(volatile uint32_t*)0x424102A0)
#define C9_OUT  (*(volatile uint32_t*)0x424102A4)
#define C10_OUT (*(volatile uint32_t*)0x424102A8)
#define C11_OUT (*(volatile uint32_t*)0x424102AC)
#define C12_OUT (*(volatile uint32_t*)0x424102B0)
#define C13_OUT (*(volatile uint32_t*)0x424102B4)
#define C14_OUT (*(volatile uint32_t*)0x424102B8)
#define C15_OUT (*(volatile uint32_t*)0x424102BC)
// GPIOC_IN
#define C0_IN  (*(volatile uint32_t*)0x42410200)
#define C1_IN  (*(volatile uint32_t*)0x42410204)
#define C2_IN  (*(volatile uint32_t*)0x42410208)
#define C3_IN  (*(volatile uint32_t*)0x4241020C)
#define C4_IN  (*(volatile uint32_t*)0x42410210)
#define C5_IN  (*(volatile uint32_t*)0x42410214)
#define C6_IN  (*(volatile uint32_t*)0x42410218)
#define C7_IN  (*(volatile uint32_t*)0x4241021C)
#define C8_IN  (*(volatile uint32_t*)0x42410220)
#define C9_IN  (*(volatile uint32_t*)0x42410224)
#define C10_IN (*(volatile uint32_t*)0x42410228)
#define C11_IN (*(volatile uint32_t*)0x4241022C)
#define C12_IN (*(volatile uint32_t*)0x42410230)
#define C13_IN (*(volatile uint32_t*)0x42410234)
#define C14_IN (*(volatile uint32_t*)0x42410238)
#define C15_IN (*(volatile uint32_t*)0x4241023C)	
// GPIOD_OUT
#define D0_OUT  (*(volatile uint32_t*)0x42418280)
#define D1_OUT  (*(volatile uint32_t*)0x42418284)
#define D2_OUT  (*(volatile uint32_t*)0x42418288)
#define D3_OUT  (*(volatile uint32_t*)0x4241828C)
#define D4_OUT  (*(volatile uint32_t*)0x42418290)
#define D5_OUT  (*(volatile uint32_t*)0x42418294)
#define D6_OUT  (*(volatile uint32_t*)0x42418298)
#define D7_OUT  (*(volatile uint32_t*)0x4241829C)
#define D8_OUT  (*(volatile uint32_t*)0x424182A0)
#define D9_OUT  (*(volatile uint32_t*)0x424182A4)
#define D10_OUT (*(volatile uint32_t*)0x424182A8)
#define D11_OUT (*(volatile uint32_t*)0x424182AC)
#define D12_OUT (*(volatile uint32_t*)0x424182B0)
#define D13_OUT (*(volatile uint32_t*)0x424182B4)
#define D14_OUT (*(volatile uint32_t*)0x424182B8)
#define D15_OUT (*(volatile uint32_t*)0x424182BC)
// GPIOD_IN
#define D0_IN  (*(volatile uint32_t*)0x42418200)
#define D1_IN  (*(volatile uint32_t*)0x42418204)
#define D2_IN  (*(volatile uint32_t*)0x42418208)
#define D3_IN  (*(volatile uint32_t*)0x4241820C)
#define D4_IN  (*(volatile uint32_t*)0x42418210)
#define D5_IN  (*(volatile uint32_t*)0x42418214)
#define D6_IN  (*(volatile uint32_t*)0x42418218)
#define D7_IN  (*(volatile uint32_t*)0x4241821C)
#define D8_IN  (*(volatile uint32_t*)0x42418220)
#define D9_IN  (*(volatile uint32_t*)0x42418224)
#define D10_IN (*(volatile uint32_t*)0x42418228)
#define D11_IN (*(volatile uint32_t*)0x4241822C)
#define D12_IN (*(volatile uint32_t*)0x42418230)
#define D13_IN (*(volatile uint32_t*)0x42418234)
#define D14_IN (*(volatile uint32_t*)0x42418238)
#define D15_IN (*(volatile uint32_t*)0x4241823C)
// GPIOE_OUT
#define E0_OUT  (*(volatile uint32_t*)0x42420280)
#define E1_OUT  (*(volatile uint32_t*)0x42420284)
#define E2_OUT  (*(volatile uint32_t*)0x42420288)
#define E3_OUT  (*(volatile uint32_t*)0x4242028C)
#define E4_OUT  (*(volatile uint32_t*)0x42420290)
#define E5_OUT  (*(volatile uint32_t*)0x42420294)
#define E6_OUT  (*(volatile uint32_t*)0x42420298)
#define E7_OUT  (*(volatile uint32_t*)0x4242029C)
#define E8_OUT  (*(volatile uint32_t*)0x424202A0)
#define E9_OUT  (*(volatile uint32_t*)0x424202A4)
#define E10_OUT (*(volatile uint32_t*)0x424202A8)
#define E11_OUT (*(volatile uint32_t*)0x424202AC)
#define E12_OUT (*(volatile uint32_t*)0x424202B0)
#define E13_OUT (*(volatile uint32_t*)0x424202B4)
#define E14_OUT (*(volatile uint32_t*)0x424202B8)
#define E15_OUT (*(volatile uint32_t*)0x424202BC)
// GPIOE_IN
#define E0_IN  (*(volatile uint32_t*)0x42420200)
#define E1_IN  (*(volatile uint32_t*)0x42420204)
#define E2_IN  (*(volatile uint32_t*)0x42420208)
#define E3_IN  (*(volatile uint32_t*)0x4242020C)
#define E4_IN  (*(volatile uint32_t*)0x42420210)
#define E5_IN  (*(volatile uint32_t*)0x42420214)
#define E6_IN  (*(volatile uint32_t*)0x42420218)
#define E7_IN  (*(volatile uint32_t*)0x4242021C)
#define E8_IN  (*(volatile uint32_t*)0x42420220)
#define E9_IN  (*(volatile uint32_t*)0x42420224)
#define E10_IN (*(volatile uint32_t*)0x42420228)
#define E11_IN (*(volatile uint32_t*)0x4242022C)
#define E12_IN (*(volatile uint32_t*)0x42420230)
#define E13_IN (*(volatile uint32_t*)0x42420234)
#define E14_IN (*(volatile uint32_t*)0x42420238)
#define E15_IN (*(volatile uint32_t*)0x4242023C)	
// GPIOF_OUT
#define F0_OUT  (*(volatile uint32_t*)0x42428280)
#define F1_OUT  (*(volatile uint32_t*)0x42428284)
#define F2_OUT  (*(volatile uint32_t*)0x42428288)
#define F3_OUT  (*(volatile uint32_t*)0x4242828C)
#define F4_OUT  (*(volatile uint32_t*)0x42428290)
#define F5_OUT  (*(volatile uint32_t*)0x42428294)
#define F6_OUT  (*(volatile uint32_t*)0x42428298)
#define F7_OUT  (*(volatile uint32_t*)0x4242829C)
#define F8_OUT  (*(volatile uint32_t*)0x424282A0)
#define F9_OUT  (*(volatile uint32_t*)0x424282A4)
#define F10_OUT (*(volatile uint32_t*)0x424282A8)
#define F11_OUT (*(volatile uint32_t*)0x424282AC)
#define F12_OUT (*(volatile uint32_t*)0x424282B0)
#define F13_OUT (*(volatile uint32_t*)0x424282B4)
#define F14_OUT (*(volatile uint32_t*)0x424282B8)
#define F15_OUT (*(volatile uint32_t*)0x424282BC)	
// GPIOF_IN
#define F0_IN  (*(volatile uint32_t*)0x42428200)
#define F1_IN  (*(volatile uint32_t*)0x42428204)
#define F2_IN  (*(volatile uint32_t*)0x42428208)
#define F3_IN  (*(volatile uint32_t*)0x4242820C)
#define F4_IN  (*(volatile uint32_t*)0x42428210)
#define F5_IN  (*(volatile uint32_t*)0x42428214)
#define F6_IN  (*(volatile uint32_t*)0x42428218)
#define F7_IN  (*(volatile uint32_t*)0x4242821C)
#define F8_IN  (*(volatile uint32_t*)0x42428220)
#define F9_IN  (*(volatile uint32_t*)0x42428224)
#define F10_IN (*(volatile uint32_t*)0x42428228)
#define F11_IN (*(volatile uint32_t*)0x4242822C)
#define F12_IN (*(volatile uint32_t*)0x42428230)
#define F13_IN (*(volatile uint32_t*)0x42428234)
#define F14_IN (*(volatile uint32_t*)0x42428238)
#define F15_IN (*(volatile uint32_t*)0x4242823C)	
// GPIOG_OUT
#define G0_OUT  (*(volatile uint32_t*)0x42430280)
#define G1_OUT  (*(volatile uint32_t*)0x42430284)
#define G2_OUT  (*(volatile uint32_t*)0x42430288)
#define G3_OUT  (*(volatile uint32_t*)0x4243028C)
#define G4_OUT  (*(volatile uint32_t*)0x42430290)
#define G5_OUT  (*(volatile uint32_t*)0x42430294)
#define G6_OUT  (*(volatile uint32_t*)0x42430298)
#define G7_OUT  (*(volatile uint32_t*)0x4243029C)
#define G8_OUT  (*(volatile uint32_t*)0x424302A0)
#define G9_OUT  (*(volatile uint32_t*)0x424302A4)
#define G10_OUT (*(volatile uint32_t*)0x424302A8)
#define G11_OUT (*(volatile uint32_t*)0x424302AC)
#define G12_OUT (*(volatile uint32_t*)0x424302B0)
#define G13_OUT (*(volatile uint32_t*)0x424302B4)
#define G14_OUT (*(volatile uint32_t*)0x424302B8)
#define G15_OUT (*(volatile uint32_t*)0x424302BC)
// GPIOG_IN
#define G0_IN  (*(volatile uint32_t*)0x42430200)
#define G1_IN  (*(volatile uint32_t*)0x42430204)
#define G2_IN  (*(volatile uint32_t*)0x42430208)
#define G3_IN  (*(volatile uint32_t*)0x4243020C)
#define G4_IN  (*(volatile uint32_t*)0x42430210)
#define G5_IN  (*(volatile uint32_t*)0x42430214)
#define G6_IN  (*(volatile uint32_t*)0x42430218)
#define G7_IN  (*(volatile uint32_t*)0x4243021C)
#define G8_IN  (*(volatile uint32_t*)0x42430220)
#define G9_IN  (*(volatile uint32_t*)0x42430224)
#define G10_IN (*(volatile uint32_t*)0x42430228)
#define G11_IN (*(volatile uint32_t*)0x4243022C)
#define G12_IN (*(volatile uint32_t*)0x42430230)
#define G13_IN (*(volatile uint32_t*)0x42430234)
#define G14_IN (*(volatile uint32_t*)0x42430238)
#define G15_IN (*(volatile uint32_t*)0x4243023C)		
// GPIOH_OUT
#define H0_OUT  (*(volatile uint32_t*)0x42438280)
#define H1_OUT  (*(volatile uint32_t*)0x42438284)
//#define H2_OUT  (*(volatile uint32_t*)0x42438288)
//#define H3_OUT  (*(volatile uint32_t*)0x4243828C)
//#define H4_OUT  (*(volatile uint32_t*)0x42438290)
//#define H5_OUT  (*(volatile uint32_t*)0x42438294)
//#define H6_OUT  (*(volatile uint32_t*)0x42438298)
//#define H7_OUT  (*(volatile uint32_t*)0x4243829C)
//#define H8_OUT  (*(volatile uint32_t*)0x424382A0)
//#define H9_OUT  (*(volatile uint32_t*)0x424382A4)
//#define H10_OUT (*(volatile uint32_t*)0x424382A8)
//#define H11_OUT (*(volatile uint32_t*)0x424382AC)
//#define H12_OUT (*(volatile uint32_t*)0x424382B0)
//#define H13_OUT (*(volatile uint32_t*)0x424382B4)
//#define H14_OUT (*(volatile uint32_t*)0x424382B8)
//#define H15_OUT (*(volatile uint32_t*)0x424382BC)	
// GPIOH_IN
#define H0_IN  (*(volatile uint32_t*)0x42438200)
#define H1_IN  (*(volatile uint32_t*)0x42438204)
//#define H2_IN  (*(volatile uint32_t*)0x42438208)
//#define H3_IN  (*(volatile uint32_t*)0x4243820C)
//#define H4_IN  (*(volatile uint32_t*)0x42438210)
//#define H5_IN  (*(volatile uint32_t*)0x42438214)
//#define H6_IN  (*(volatile uint32_t*)0x42438218)
//#define H7_IN  (*(volatile uint32_t*)0x4243821C)
//#define H8_IN  (*(volatile uint32_t*)0x42438220)
//#define H9_IN  (*(volatile uint32_t*)0x42438224)
//#define H10_IN (*(volatile uint32_t*)0x42438228)
//#define H11_IN (*(volatile uint32_t*)0x4243822C)
//#define H12_IN (*(volatile uint32_t*)0x42438230)
//#define H13_IN (*(volatile uint32_t*)0x42438234)
//#define H14_IN (*(volatile uint32_t*)0x42438238)
//#define H15_IN (*(volatile uint32_t*)0x4243823C)	






	











